import { Container } from 'components/ui/Container';
import s from './Delivery.module.scss';
import { NavigationProduct } from '../NavigationProduct';

export const Delivery = () => {
    return (
        <Container>
            <div className={s.product__wrapper}>
                <div className={s.tab_product}>
                    <h1 className={`${s.tab_product__subtitle} ${s.product__subtitle}`}>
                        Оформлення замовлення
                    </h1>
                    <div className={s.tab_product__text}>
                        <p>
                            Додавши необхідні товари в кошик,
                            важливо заповнити всі поля при оформленні замовлення.
                            По можливості, вказуйте всі контактні дані (нр.телефону та ел.пошту),
                            щоб була альтернативна форма зв'язку з Вами.
                        </p>
                    </div>
                    <h2 className={`${s.tab_product__subtitle} ${s.product__subtitle}`}>
                        Доставка
                    </h2>
                    <div className={s.tab_product__text}>
                        <p>
                            При виборі способу доставки важливо врахувати, що в деяких відділеннях Нової пошти, а також у всіх поштах є обмеження по вазі. Тому, якщо Ви не можете знайти потрібне відділення, перевірте, чи не перевищує допустимі габарити/вага, обраний Вами товар.
                        </p>
                    </div>
                    <h2 className={`${s.tab_product__subtitle} ${s.product__subtitle}`}>
                        Вартість доставки
                    </h2>
                    <div className={s.tab_product__text}>
                        <p>
                            Точний підрахунок вартість доставки провадиться на момент оформлення відправки працівниками Нової пошти. Після оформлення відправки нами, чекайте на номер ТТН в СМС повідомленні. Інформація щодо відстеження ТТН містить точну вартість.
                        </p>
                    </div>
                    <h2 className={`${s.tab_product__subtitle} ${s.product__subtitle}`}>
                        Оплата
                    </h2>
                    <div className={s.tab_product__text}>
                        <p>
                            <strong>Післяплата</strong>
                            - це спосіб оплати покупцем посилки/доставки при її отриманні. Вартість пересилання збільшується, адже по суті здійснюється доставка у 2 кінці – адресату пересилається замовлений товар, а продавцю – повернення грошей. На сьогоднішній день, це найпопулярніший спосіб оплати, адже він виключає всі ризики для покупця.
                        </p>
                        <p>
                            <strong>Оплата за реквізитами</strong>
                            – популярна послуга з переказу грошей на замовлення. Якщо Вам зручно сплатити замовлення відразу, Ви не прив'язані до певного часу чи місця: сплатити, перебуваючи вдома, на роботі чи на відпочинку, то обирайте спосіб оплати за реквізитами. Основною перевагою є мінімальний тариф доставки.
                        </p>
                    </div>
                    <h2 className={`${s.tab_product__subtitle} ${s.product__subtitle}`}>
                        Ідентифікація оплати
                    </h2>
                    <div className={s.tab_product__text}>
                        <p>
                            <strong>Увага! Оплачуючи за реквізитами, важливо вказати № замовлення у призначенні платежу!</strong>
                            - це спосіб оплати покупцем посилки/доставки при її отриманні. Вартість пересилання збільшується, адже по суті здійснюється доставка у 2 кінці – адресату пересилається замовлений товар, а продавцю – повернення грошей. На сьогоднішній день, це найпопулярніший спосіб оплати, адже він виключає всі ризики для покупця.
                            <strong>скрин квитанції про оплату</strong> або <strong>надати</strong> наступну <strong>інформацію в чат</strong> : (номер замовлення, дата та час проведення платежу, найменування банку-платника).
                        </p>
                        <p>
                            <strong>Увага! Будь ласка, не оплачуйте одним платежем відразу кілька замовлень!</strong>
                            Ідентифікація платежу ускладнюється (уточнення/пошук інформації), а це впливає на час надсилання замовлення.
                        </p>
                    </div>
                </div>
            </div>
        </Container>
    )
}